#! usr/bin/python
# coding:UTF-8

ss = """
韩氏商业协会总部所在地就在商业星上，同样的，也是齐格勒敲来的一块战利品。  商业协会下辖三块封地、四百万人，云米、碎玉果的技术已经交出去了，不用担心泄密不泄密的，在这事上，威廉他们会比自己更加的关注。

    威斯特这里要人留守，还必须是信的过的人，韩真几经考虑后，从参谋部中选出了两个已经能负责一方事务的大员在这里主持：吕志城，冯举，都是杜国盛经过多年培养的中坚力量。

    只在威斯特留下了一百艘的战舰与一千艘的运输舰，没有必要太多，明年就会有大批的进帐，5％的分红可不是小数目，加上即将动工的种子基地，就是不做其他的生意，光这都能让人眼红。

    有时在封地转转，看看基础建设的进程；有时在停舰坪处关心关心物资准备工作；还有空闲的话，就和一脸郁闷表情的齐格勒聊聊天打打屁，交流一下是个男人都关心的话题。  十来天的时间，很快就过去，在一切都准备就绪后，韩真向齐格勒提出了辞行。

    “这两个多月，是我这几十年中过的最开心的时候了，真是舍不得你走啊！”齐格勒眼眶湿润了，“阿真，不回维西不行吗？在威斯特你想要什么我都有办法给你办到，就是完全掌管的星球，也同样的有办法可想……。  ”

    韩真轻轻一笑，摆了摆头。  发现这话没有用，齐格勒急了：“你可以把维西那边的事务交给下面地人去负责啊，没有必要一定得回去，你现在可是我威斯特的人，这里才是你的家！”

    “不要说这个了，大禹星的特殊你又不是不知道，那可是颗宝星啊。  我还指望着它产的云米与碎玉果行销整个宇宙呢！这么重要的地方完全让别人来管理，我怎可能放心。  ”韩真拍了拍他的肩膀。  轻松地说：“我又不是不过来了，就像你说的，威斯特才是我地家，我可是堂堂的威斯特世袭贵族！对了，等你登基后，我是一定要做亲王的，有这样的好事。  我怎么可能错过！”

    看到齐格勒还是闷闷不乐，韩真想了下后接着说：“你成为太子时我是没办法赶过来，但我向你保证，在你正式成为皇帝的那天，我一定会来参加你的登基大典。  再说时间也不长嘛，也就是十来年，一晃就过了，只希望那时候你还没把我给忘了！”

    送行的舰队与星球在全息屏中慢慢地变小。  直至完全的消失，韩真关上后转动着皇佩，思绪万千。

    来时是小猫两三只，这返程时，舰队的规模就是天壤之别了：近四万的舰船把停舰坪占的满满当当。  这次的威斯特之行收获实在是太过于丰厚了，韩真之前是怎么都没有想到的。  这些东西要是凭借自己本身的实力来一点点地赚取，也是可能的，再怎么说韩真也有着独门的技术，但时间上要的可就久了。  其实在威斯特最大的收获，还是这个贵族身份的确定：手上能出产地好东西很多，可宇宙中患红眼病的国家与商团更是多的数不胜数，有了这响当当的身份之后，只要韩真多注意点、让人察觉不到技术上的秘密，销售方面就不会有多大问题了。

    今天来送行的除了齐格勒，还有四个权势家族的准继承人。  各家族的教育不同。  其他的准继承人都相继来电表示了歉意。  能向自己示好，当然是看在齐格勒的份上。  不然吊都不会吊自己。

    “还是太弱了啊，不过不要紧，十年后见，我会让你们知道我地实力地！那时候，就不会像今天这样的不重视了吧！”韩真自语道。  从来到威斯特，除了交出技术时韩真与威廉十四世见过一面，就只有受封时地一次了，一共两次；其他的家族族长与长老会的长老们，都是只有受封时的那一次集体出席，从这些事上就可以看出对自己的不重视——当然，是在把技术拿到手后的不重视，要是自己一直不给的话，那就会极为重视了，对照一下，还是目前这种状况为好，可以让自己慢慢的来积赞实力。  想通后，韩真把皇佩拿到自己的眼前凝视，突然狠狠的亲了一口。

    舰队出来首都圈，汇合了外围封地最后的一批运输舰后，径直开向了边境。

    ※※※※※※※※※※※

    地球所处的地段，现在在广义上是受到四级国家若玛的管理，本来轮不上它的，但谁让五级的西格帝国运气不好，让一大批的四级国家联合起来出了头呢？

    通常的管理办法是这样的，五级国家在揽括了一大批直属管理的国家后，就把那些实在是照顾不到的国家都分给了下面的四级国家，只要自己紧紧的抓住这些四级国家就行了；四级国家也是采用同样的办法，自己吃饱后把一些多出的、价值不大的国家交给三极国家来控制，依次类推下去。

    现在的情况则发生了变化，四级的出头了，管理方面十分的杂乱，在威斯特还没有真正成为四级文明、拥有震的住全部的四级国家的声势之前，这种情况会一直的持续下去。

    多头共存、谁都不服谁的后果就是各个四级国家都借机划定出了各自的势力范围，把原五级国家西格帝国的势力进行了瓜分。  就如这四级若玛的势力范围之中，从一级到三极的国家都是被他直接的管理、控制，地球这个弱小到几乎可以忽略不计的一级小国家，也同样被它管理了起来。

    只是因为地球这样的一级国家实在是太弱小了，让若玛这四级“大国”看不到眼里。  它的关注方向是从二级开始，这样一来就便宜了天顿、维尔达、雷诺三国，让他们也能够享受一下剥削地瘾头。  不过若玛下放的权利并不会太大，有着极多的限制，也就使得天顿他们不敢过份，不敢像上下级那样的予取予求、杀伐有心，形成了现在这种让若玛这些四级国家较为满意、较为温和的管理模式。

    地球想要使文明升级。  就必须通过若玛亲自考核后才能通过，天顿他们还没有这个权利。  不过对想上位的一级国家，天顿的打击可都是不遗余力地——升上二级就能够和若玛直接的对话了，自己能够从中获得地利益就要少的多，当然不愿意。  虽然手段上不敢太过，但用封锁的这种软方式也能屡次的达到目的，不过这封杀一定得小心翼翼，被若玛发现就麻烦大了。

    韩真在离开大禹星时就定下了两手准备。  一是让人送朱继民他们到地球，把地球五颗星都收归整合，建立符合二级国家的实力与经济；二是派人到若玛去，利用自己唬的住人地身份，让若玛派出考核团。  具体的相关事宜，由参谋部长杜国盛来负责布置。

    这是一支庞大的舰队，四百艘的43战舰，一千艘的35战舰。  五千艘的25战舰，加上数量过万的运输舰船，浩浩荡荡。

    舰队的旗舰中，高震连看着茫茫地星空，一想到在今天之内就能够到家，胸腔的热血都忍不住的翻滚起来。  “谁能想到。  离开地球才五年的时间，自己就能带着如此强大的舰队杀回来呢！”

    在杜国盛安排之下，高震连在若?***俗羁斓乃俣劝亚捌诠ぷ髯鐾辏缓蟠湃袈昱沙龅乜己硕永吹降厍颍级缘厍蚪屑匾奈拿骺己恕?

    金元攻势在哪个国家都适用，只是效果多寡的问题，不过在若玛，效果远远的超乎想像。  在大事上，杜国盛非常的有魄力，他手上本来就有着韩真留下的好几万亿资金。  加上考拉奇的货款也给的十分的及时。  就使得他在韩真离开没多久、就能够支配十五万亿的维西币。  送礼要狠，拿出了三万亿给高震连在若玛上下打点。  加上所求地事在若玛高层地眼中只是小的不能再小地事，因此只用了半个月，前所未有的就派出了考核队跟随着一起到地球去。  其实打点了这么多钱，就是不去考核、也能让地球变成二级国家，顶多时间上要长一些，这是杜国盛他们这些留守大禹星的人没有预料到的，但略经分析之后，还是要求考核团去地球！因为除了让地球升级文明之外，还需要让若玛看看下面的境况，比如：天顿三国在下面大胆的举动，给反击天顿三国提前的打好招呼。  韩真从来没有放弃过对天顿三国的报复，只要让若玛认识到天顿三国已经不把自己放在眼里，明目张胆的在侵占若玛的利益，就可以借若玛的手惩戒他们一番。

    高震连的旁边，是贺荣光，他出演的是从地球出去到若玛帝国要求文明等级提升的外交官员，现在也是一脸唏嘘的看着外界。  这时刻，全部近万从地球出来的人，几乎都在看着这千篇一律的星空。

    “前方发现未知战舰，数量四十六艘，舰型分析为34型战列舰，高速分散式行使，在21分钟将进入警戒范围。  ”负责探测雷达的通讯员发来了消息。

    高震连和贺荣光对视了一眼，明白这应该是天顿三国的舰队，也是自己以后必然会成为敌人的舰队。

    高震连看了下要到达的时间，六个小时，这可是真真正正属于地球中华国的环内星空啊，“挂上中华旗，挂上第九舰队徽章，屏蔽仪器全面的开动！迎上去，给我全部予以扣留。  ”高震连毫不考虑的下达了命令。

    “怎么啦，高将军，为什么要扣留呢？不是说再有六个小时就到达七十……地球了吗？这肯定是地球的巡逻队。  ”三名穿着若玛传统服装的中年人刚好走进来，听到了高震连的最后一句命令，中间的一人不解的问道。  这三人就是若玛考核团的负责人，带领着整个团六千多人来对地球进行考核。

    高震连并没有告诉他们天顿三国在地球所作的一切，因为杜国盛认为，让他们亲眼看到的话，震撼效果会更大一些。

    “哦，是这样的，岳邦专员，在昨天，我的先谴队遇到了几艘不明战舰，捕获后发现有两支小海盗想偷袭中华国的一个矿业开采区，所以今天我就让舰队分成了四个支队，用包围的方式朝地球行进，这样就能把海盗一网打尽！还有就是，这里出现的未知战舰，都是三型的战舰，中华国现在只有些二级的战舰，所以我想，这应该就是海盗的警戒部队！如果是过路商队的话，我会在调查清楚后放走的。  ”高震连一本正经的说道。

    “哦，是这样啊，这些天杀的海盗是该被全部的剿灭！”岳邦深有同感的点点头，不管是哪个国家，对海盗都是除恶务尽的态度，就算是和海盗有着瓜葛的国家，明面上也是同一种论调。

    四十六艘落后的战舰，看到铺天盖地，力量对比悬殊的舰队包围过来时，极为明智的选择了投降。  这让高震连有点小小的郁闷，他在要求挂上中华旗时，就想着让对方看到后反抗一下，自己就能够拿他们出出多年的怨气，哪里想到对方会这么的不顶事，直接就投降了！

    高震连有着绝对的信心让对方不能放出预警的信号才这样干的，战舰差距太大，数量差差距太大，加上屏蔽器提前的开启，这样要是还让对方搞出花样，高震连也就不是八大将军之一了。

    “双头狼奥托！！！”岳邦三人在高震连指挥时自动的进行了回避，这是常识问题，任何人都不得在战斗状态中对指挥官进行干扰。  战斗刚过，高震连就把他们请回来，而在刚一看到全息屏中海盗战舰的徽章时，就不约而同的喊出了这个名字。

    双头狼奥托，一直骚扰若玛帝国的一支海盗，穷凶极恶，名声之高相当于黑杰克在维西一片；在实力上，却比黑杰克差的多，这和地理方面有关：黑杰克占据的地盘很富饶，老巢也更加的安全，是双头狼比不了的。
"""

print ss.replace(" ", "").replace("\n", "")


